import matplotlib.pyplot as plt
import matplotlib

# 设置全局字体为 Times New Roman
matplotlib.rcParams['font.family'] = 'Times New Roman'
matplotlib.rcParams['font.size'] = 16  # 同时设置字体大小

# 假设这是您的算法和对比算法的精度数据
# 精度值
accuracy_your_algorithm = [40.44, 43.16, 44.38, 45.01, 45.92, 45.92, 45.99, 46.43, 47.47, 48.09, 49.25, 49.38, 49.5,
                           50.06, 50.08, 50.56, 50.56, 50.67, 50.98, 50.98, 51.07, 51.17, 51.4, 51.4, 51.4, 51.4, 51.42,
                           51.44, 51.59, 51.71, 51.71, 52.02, 52.02, 52.06, 52.06, 52.06, 52.06, 52.06, 52.06, 52.06,
                           52.06, 52.06, 52.06, 52.06, 52.06, 52.06, 52.06, 52.08, 52.14, 52.14, 52.14, 52.14, 52.14,
                           52.14, 52.16, 52.17, 52.48, 52.5, 52.71, 52.81, 52.82, 53.16, 53.16, 53.16, 53.16, 53.16,
                           53.16, 53.16, 53.16, 53.16, 53.16, 53.16, 53.46, 53.58, 53.58, 53.58, 53.58, 53.58, 53.58,
                           53.58, 53.58, 53.58, 53.58, 53.58, 53.58, 53.58, 53.58, 53.58, 53.58, 53.58, 53.6, 53.6,
                           53.6, 53.6, 53.6, 53.6, 53.6, 53.6, 53.6, 53.6, 53.6]

accuracy_your_algorithm = [x / 100 for x in accuracy_your_algorithm]

accuracy_comparison_algorithm = [39.63, 43.07, 43.93, 44.83, 45.22, 45.64, 45.92, 45.92, 45.92, 45.92, 45.92, 45.92,
                                 46.32, 46.51, 47.1, 47.31, 47.88, 47.91, 47.91, 48.3, 48.56, 48.6, 48.97, 48.97, 49.15,
                                 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25,
                                 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25,
                                 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25,
                                 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.25, 49.29,
                                 49.29, 49.29, 49.29, 49.29, 49.29, 49.29, 49.36, 49.39, 49.52, 49.58, 49.82, 50.44,
                                 50.63, 50.63, 50.78, 50.97, 51.05, 51.27, 51.27, 51.39, 51.39, 51.42, 51.42, 51.42,
                                 51.42, 51.42, 51.8, 51.8]

accuracy_comparison_algorithm = [x / 100 for x in accuracy_comparison_algorithm]

# 测试次数或版本号
tests = range(1, len(accuracy_your_algorithm) + 1)

# 创建折线图
plt.plot(tests[:70:5], accuracy_your_algorithm[:70:5], marker='o', label='With dynamic adjustment')  # 绘制您的算法精度折线图
plt.plot(tests[:70:5], accuracy_comparison_algorithm[:70:5], marker='s',
         label='Without dynamic adjustment')  # 绘制对比算法精度折线图

# 添加标题和标签
plt.xlabel(r'$Training$ $round$')  # x轴标签
plt.ylabel(r'$Accuracy$')  # y轴标签

# 显示图例
plt.legend()

plt.tick_params(axis='x', labelsize=12)
plt.tick_params(axis='y', labelsize=12)

# 强制显示完全
plt.tight_layout()

# 显示网格
plt.grid(True)

# 显示图表
plt.show()
